# Дана непустая строка S. Вывести строку, содержащую символы строки S, между
# которыми вставлено по одному пробелу.

S = input('Введите строку: ')
for stroka in S:
    print(stroka, end=' ')